performance/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm-up phase"
    - duration: 120
      arrivalRate: 5
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "MCP Tool Discovery"
    flow:
      - post:
          url: "/message"
          json:
            jsonrpc: "2.0"
            method: "mcp.discover"
            id: 1
  - name: "Health Check"
    flow:
      - get:
          url: "/health"
          capture:
            json: "$"
            as: "health"
      - log: "Health metrics: {{ health }}"